import logo from './logo.svg';
import './App.css';
import Header from './components/Header/Header';
import Shop from './components/Header/Shops/Shop';

function App() {
  return (
    <div className="App">
      <Header></Header>
      <Shop></Shop>
      
      <div>
            <h3>1.how react work
      রিয়েক্ট হল একটি জাভাস্ক্রিপ্ট লাইব্রেরি (কোন ফ্রেমওয়ার্ক নয়) যা ঘোষণামূলক কোড ব্যবহার করে অনুমানযোগ্য এবং দক্ষ উপায়ে ব্যবহারকারী ইন্টারফেস (UIs) তৈরি করে। এটি আপনার অ্যাপ্লিকেশানের প্রতিটি  স্টেটের জন্য সাধারণ ভিউ ডিজাইন করে এবং আপনার ডেটা পরিবর্তিত হলে প্রতিক্রিয়া ও দক্ষতার সাথে সঠিকভাবে আপডেট এবং রেন্ডার করবে। </h3>
      <h3>2.how to  different props vs state 
      প্রপস শুধুমাত্র পঠনযোগ্য । 
      স্টেটের পরিবর্তনশীল। 
      স্টেটের পরিবর্তনগুলি অ্যাসিঙ্ক্রোনাস হতে পারে। 
      প্রপস অপরিবর্তনীয়। 
      স্টেট অভ্যন্তরীণ এবং কম্পোনেন্টের দ্বারাই নিয়ন্ত্রিত হয় যখন প্রপগুলি বাহ্যিক এবং কম্পোনেন্ট রেন্ডার করা যাই হোক না কেন তা দ্বারা নিয়ন্ত্রিত।</h3>
      <h3>
      3. How  useState work 
      useState হল একটি হুক (ফাংশন)  যা আপনাকে ফাংশন উপাদানগুলিতে প্রতিক্রিয়া ও অবস্থা যোগ করে দেয়। 
      এটি বর্তমান অবস্থার মান (প্রাথমিক অবস্থা নয়) এবং এই মান আপডেট করার জন্য অন্য একটি ফাংশন সহ একটি ভেরিয়েবল প্রদান করে।
      </h3>
    </div>
    </div>
  );
}

export default App;
